---
kind: type
id: T:Autodesk.Revit.DB.Structure.IMemberForcesServer
source: html/b644f481-b5e5-0368-4dce-cf1cb068cbc1.htm
---
# Autodesk.Revit.DB.Structure.IMemberForcesServer

Interface for the Member Forces server to implement.

## Syntax (C#)
```csharp
public interface IMemberForcesServer : IExternalServer
```